const city24bayarea = [
    {
        'type': 'Feature',
        'geometry': {
            'type': 'LineString',
            'coordinates': [
                [135.41242549009365, 34.638461373083416],
                [135.42053883035527, 34.63089786792125],
                [135.4306430763076, 34.63077239124429],
                [135.43712825653267, 34.61386196885539],
                [135.44734419136574, 34.6138015358478],
                [135.4574741169689, 34.61081596196347],
                [135.47146386827245, 34.609321829677]
            ]
        },
        'properties': {
            'title': 'Trade Center mae ⇄ Suminoekouen 🇯🇵 New Tram (Osaka, Japan)',
            'address': 'ニュートラム（トレードセンター前⇄住之江公園）',
            'link': "index/?id=osaka-city24&area=suminoe-nanko",
            'zoom': 14.5
        }
    },
    {
        'type': 'Feature',
        'geometry': {
            'type': 'LineString',
            'coordinates': [
                [135.47146386827245, 34.609321829677],
                [135.4574741169689, 34.61081596196347],
                [135.44734419136574, 34.6138015358478],
                [135.43382953510434, 34.613907109890135],
                [135.43385144843262, 34.61169118729816],
                [135.41843968425383, 34.61184220479092],
                [135.41730047899017, 34.61548320882365],
                [135.41141605710726, 34.61545785643571],
                [135.40865560733192, 34.614595779048614],
                [135.4037844060449, 34.61458318751603]
            ]
        },
        'properties': {
            'title': '21 Minute Cycling to Nanko Fishing Port 🇯🇵 Osaka, Japan',
            'address': '住之江公園駅から南港南の西の果てまで',
            'link': "spot/?id=osaka-city24&area=suminoe&name=nankou-uotsuri-en",
            'zoom': 14.5
        }
    },
    {
        'type': 'Feature',
        'geometry': {
            'type': 'LineString',
            'coordinates': [
                [135.4632278536988, 34.629289223177636],
                [135.46729651978637, 34.62871866153678],
                [135.46853656762892, 34.63458250979764],
                [135.47401271758065, 34.63301208712039]
            ]
        },
        'properties': {
            'title': '16 Minute Cycling in Taisho 🇯🇵 Osaka, Japan',
            'address': '新木津川大橋 ⇄ 千本松大橋',
            'link': 'index/?id=osaka-ferry',
            'zoom': 14.5
        }
    }
]