'use strict'

map.on('load', () => {
  map.addSource('addLine', {
    'type': 'geojson',
    'data': {
      'type': 'FeatureCollection',
      'features': [
        {
          'type': 'Feature',
          'geometry': {
            'type': 'LineString',
            'coordinates': [
              [135.53450260612686, 34.688496339894954],
              [135.5354424361597, 34.69242388834881],
              [135.53531023841867, 34.693699643521356],
              [135.5330439390151, 34.698893529353285],
              [135.53220603151203, 34.69992010017009],
              [135.52439430104204, 34.704692888393325],
              [135.5222800276979, 34.70518247253948],
              [135.5204493925728, 34.704924936880275],
              [135.51647977297216, 34.703671466960145],
              [135.51484414217254, 34.70371124282535],
              [135.51352255387275, 34.70412169253132],
              [135.5104712918939, 34.70599305077192],
              [135.50910075587757, 34.70643568031724],
              [135.50582128363862, 34.70660468363279],
              [135.50358370694653, 34.70598021194429],
              [135.50122444222114, 34.70468448019783],
              [135.49958961204516, 34.70412917690382],
              [135.48656423280556, 34.697090482577366]
            ]
          },
          'properties': {
            'title': 'Osaka Castle Park to Fukushima 🇯🇵 Osaka Loop Line',
            'address': '大阪JR環状線（大阪城公園駅→福島駅）',
            'link': null,
            'youtube': 'Fkiq6MvW868',
            'zoom': 13
          }
        },
        {
          'type': 'Feature',
          'geometry': {
            'type': 'LineString',
            'coordinates': [
              [135.51411388098006, 34.64719329063942],
              [135.5190702216264, 34.64580472176178],
              [135.52252640610055, 34.64712716041433],
              [135.5253572221883, 34.650267713027105],
              [135.5326799850228, 34.672159115783046],
              [135.5331130709123, 34.67450978871571],
              [135.53414439908613, 34.677853434544446],
              [135.53419959431164, 34.679095090294155],
              [135.53388083546326, 34.68108346805866]
            ]
          },
          'properties': {
            'title': 'Tennoji ⇄ Morinomiya 🇯🇵 Osaka Loop Line',
            'address': '大阪JR環状線（天王寺⇄森ノ宮）',
            'link': null,
            'youtube': 'tOOHtkKQVnM',
            'zoom': 14.5
          }
        },
        {
          'type': 'Feature',
          'geometry': {
            'type': 'LineString',
            'coordinates': [
              [135.5003174898274, 34.66543796907871],
              [135.50030628762727, 34.66561475614718],
              [135.50033919576254, 34.6671500335933],
              [135.5003381895392, 34.67521533287547],
              [135.5009634913079, 34.69254325669749],
              [135.50130515006782, 34.69617764207153],
              [135.50128887867527, 34.69641352092154],
              [135.5005637593148, 34.698177518236776],
              [135.49943392544867, 34.700983588349715],
              []
            ]
          },
          'properties': {
            'title': 'Midosuji Street 🇯🇵 Osaka, Japan',
            'address': '御堂筋イルミネーション（11月上旬から12月31日）',
            'link': "spot/?id=osaka&area=city24&name=midosuji",
            'zoom': 14
          }
        },
        {
          'type': 'Feature',
          'geometry': {
            'type': 'LineString',
            'coordinates': [
              [135.4632278536988, 34.629289223177636],
              [135.46729651978637, 34.62871866153678],
              [135.46853656762892, 34.63458250979764],
              [135.47401271758065, 34.63301208712039]
            ]
          },
          'properties': {
            'title': '16 Minute Cycling in Taisho 🇯🇵 Osaka, Japan',
            'address': '新木津川大橋 ⇄ 千本松大橋',
            'link': 'index/?id=osaka-ferry',
            'zoom': 14.5
          }
        },
        {
          'type': 'Feature',
          'geometry': {
            'type': 'LineString',
            'coordinates': [
              [135.48616640248423, 34.668235971778145],
              [135.48646424045296, 34.66678246964251],
              [135.4864402034268, 34.66029060741987],
              [135.4861208972987, 34.658488239490836],
              [135.48317580772357, 34.654855367491606],
              [135.4818796717961, 34.653017557546534],
              [135.48151381111435, 34.650842576464804],
              [135.4817762092934, 34.649585167459094],
              [135.48221711407632, 34.64864940280861],
              [135.49471300829413, 34.630698182003016]
            ]
          },
          'properties': {
            'title': 'Shiomibashi ⇄ Kishinosato-Tamade 🇯🇵 Nankai Koya (Shiomibashi) Line',
            'address': '南海汐見橋線（汐見橋⇄岸里玉出）',
            'link': null,
            'zoom': 15
          }
        },
        {
          'type': 'Feature',
          'geometry': {
            'type': 'LineString',
            'coordinates': [
              [135.41242549009365, 34.638461373083416],
              [135.42053883035527, 34.63089786792125],
              [135.4306430763076, 34.63077239124429],
              [135.43712825653267, 34.61386196885539],
              [135.44734419136574, 34.6138015358478],
              [135.4574741169689, 34.61081596196347],
              [135.47146386827245, 34.609321829677]
            ]
          },
          'properties': {
            'title': 'Trade Center mae ⇄ Suminoekouen 🇯🇵 New Tram (Osaka, Japan)',
            'address': 'ニュートラム（トレードセンター前⇄住之江公園）',
            'link': "index/?id=osaka-city24&area=suminoe-nanko",
            'zoom': 14.5
          }
        },
        {
          'type': 'Feature',
          'geometry': {
            'type': 'LineString',
            'coordinates': [
              [135.47146386827245, 34.609321829677],
              [135.4574741169689, 34.61081596196347],
              [135.44734419136574, 34.6138015358478],
              [135.43382953510434, 34.613907109890135],
              [135.43385144843262, 34.61169118729816],
              [135.41843968425383, 34.61184220479092],
              [135.41730047899017, 34.61548320882365],
              [135.41141605710726, 34.61545785643571],
              [135.40865560733192, 34.614595779048614],
              [135.4037844060449, 34.61458318751603]
            ]
          },
          'properties': {
            'title': '21 Minute Cycling to Nanko Fishing Port 🇯🇵 Osaka, Japan',
            'address': '住之江公園駅から南港南の西の果てまで',
            'link': "spot/?id=osaka-city24&area=suminoe&name=nankou-uotsuri-en",
            'zoom': 14.5
          }
        }
      ]
    }
  });

  map.addLayer({
    'id': 'line',
    'type': 'line',
    'source': 'addLine',
    'layout': {
      'line-join': 'round',
      'line-cap': 'round'
    },
    'paint': {
      'line-color': 'lightskyblue',
      'line-width': 11
    }
  });
});

map.on('mouseenter', 'line', () => {
  map.getCanvas().style.cursor = 'pointer';
});

map.on('mouseleave', 'line', () => {
  map.getCanvas().style.cursor = '';
});

map.on('click', 'line', (e) => {
  map.flyTo({
    center: e.lngLat,
    essential: true,
    zoom: e.features[0].properties.zoom
  });
  infoMore(e.features[0].properties, e.features[0].geometry.coordinates[0]);
});
