'use strict'

window.onload = () => {
  map.on('load', () => {
    map.addSource('addLine', {
      'type': 'geojson',
      'data': {
        'type': 'FeatureCollection',
        'features': [
          {
            'type': 'Feature',
            'geometry': {
              'type': 'LineString',
              'coordinates': [
                [135.5223698235587, 34.73361104448734],
                [135.52729971881092, 34.73532756466886],
                [135.54774490612857, 34.73732181777264],
                [135.55294403432947, 34.74205982771849],
                [135.55329780752066, 34.74852774965018],
                [135.55468341861553, 34.7523307480925],
                [135.55813270580907, 34.75516471585623]
              ]
            },
            'properties': {
              'title': 'Naniwa Cycling Load',
              'address': 'なにわ自転車道 🚲 大阪府道803号旭西淀川自転車道線',
              'link': 'spot/?id=osaka-city24&area=yodogawa&name=naniwacycleline',
              'zoom': 14.5
            }
          },
          {
            'type': 'Feature',
            'geometry': {
              'type': 'LineString',
              'coordinates': [
                [135.55498543470247, 34.756629797861436],
                [135.54497234508813, 34.757067757663656],
                [135.5368610220993, 34.7560024459991],
                [135.52834629391748, 34.75329175765567],
                [135.52262658649013, 34.75002460892332],
                [135.5206671903981, 34.74958661177317],
                [135.51739672789705, 34.74938536902509],
                [135.51310334577954, 34.747408429257284],
                [135.50951592221216, 34.744484365676406],
                [135.50768619224934, 34.74391611459827],
                [135.50542424212705, 34.74443701156696],
                [135.4925152805751, 34.750616493229955],
                [135.48967703803433, 34.750415253027334],
                [135.48771764216863, 34.748734286298706],
                [135.48620487302702, 34.746804683671684],
                [135.48316492774265, 34.73959491072873],
                [135.48188267581935, 34.73787820533494],
                [135.47900121131096, 34.73642193768599],
                [135.4756154901558, 34.73536819952735],
                [135.47315183768828, 34.73326068290454],
                [135.46642361806119, 34.73093998452147],
                [135.4634845238107, 34.73131887851808],
                [135.45721733850496, 34.73339092426357],
                [135.4515624189167, 34.733415874036424],
                [135.4484316311729, 34.732278995169],
                [135.4468298327924, 34.72922729561742]
              ]
            },
            'properties': {
              'title': 'Naniwa Cycling Load',
              'address': 'なにわ自転車道 🚲 大阪府道803号旭西淀川自転車道線',
              'link': 'spot/?id=osaka-city24&area=yodogawa&name=naniwacycleline',
              'zoom': 14.5
            }
          }
        ]
      }
    });

    map.addLayer({
      'id': 'line',
      'type': 'line',
      'source': 'addLine',
      'layout': {
        'line-join': 'round',
        'line-cap': 'round'
      },
      'paint': {
        'line-color': 'lightskyblue',
        'line-width': 11
      }
    });
  });

  map.on('mouseenter', 'line', () => {
    map.getCanvas().style.cursor = 'pointer';
  });

  map.on('mouseleave', 'line', () => {
    map.getCanvas().style.cursor = '';
  });

  map.on('click', 'line', (e) => {
    map.flyTo({
      center: e.lngLat,
      essential: true,
      zoom: e.features[0].properties.zoom
    });
    infoMore(e.features[0].properties, e.features[0].geometry.coordinates[0]);
  });
};
